{
  "query": "summarize the article written by Akainu",
  "search_records": [
    {
      "author": "Akainu",
      "page_url": "https://www.indiatoday.in/sports/cricket/story/suyash-sharma-rcb-ipl-2025-hernia-injection-2717992-2025-05-01",
      "published_day": 1,
      "published_month": 5,
      "published_year": 2025,
      "tags": [
        "suyashsharma",
        "rcb",
        "crickethealth"
      ],
      "text": "\"I was very happy, absolutely happy. I knew that with RCB, I had a good chance. I had been practicing — this had been going on for two years. Until two years ago, I used to play by taking injections. We didn’t know what was going on in India as we didn’t know what the issue was. Then it became a problem,” Suyash told on RCB Bold Diaries. :   21-year old Suyash has been our unsung hero this #IPL! From battling pain in the body, to recovering after surgery right on time, and working hard on his fitness and variations, eager to make a strong impact - his story pic.twitter.com/bC1mt25jzW— Royal Challengers Bengaluru (@RCBTweets) May 1, 2025advertisement\"RCB sent me to London for my surgery."
    },
    {
      "author": "Akainu",
      "page_url": "https://www.indiatoday.in/sports/cricket/story/suyash-sharma-rcb-ipl-2025-hernia-injection-2717992-2025-05-01",
      "published_day": 1,
      "published_month": 5,
      "published_year": 2025,
      "tags": [
        "suyashsharma",
        "rcb",
        "crickethealth"
      ],
      "text": "Suyash Sharma thanks RCB for life-changing hernia surgery: I used to take injection - India Today India TodayAaj TakGNTTVLallantopBusiness TodayBanglaMalayalamNortheastBT BazaarHarper's BazaarSports TakCrime TakAstro TakGamingBrides TodayCosmopolitanKisan TakIshq FMIndia Today HindiReader’s DigestIndia TodayAaj TakGNTTVLallantopBusiness TodayBanglaMalayalamNortheastBT BazaarHarper's BazaarSports TakMagazineLive TVSearchSEARCHSIGN INEdition ININUSHome TVLive TVPrimetimeMagazineLatest EditionInsightBest CollegesLife+StyleIndiaSouthGlobalAll World NewsUS NewsCanada NewsUK NewsChina NewsIndians AbroadBusinessAll SportsIPL 2025TennisCricketFootballSports TodayTechnologyShowbuzzEntertainmentBollywoodHollywoodTelevisionOTTLatest ReviewsNewspresso SpecialsPodcastsFirst Things FastSunday SpecialHistory of ItNewsMoDIUInteractivesOpinionGamesVideosShort VideosFact Check Other NewsEducationIt's ViralScienceHealthAutoLaw TodayEnvironmentCitiesWeatherWeb StoriesHoroscopesDownload AppFollow Us On:   NewsSportsCricketSuyash thanks RCB for life-changing hernia surgery: I used to take injectionsSportsAllIPL 2025French OpenCricketLive ScoresFootballOther SportsFormula OneVideosVenuesSuyash Sharma thanks RCB for life-changing hernia surgery: I used to take injectionIPL 2025: RCB leg-spinner Suyash Sharma said how the Royal Challengers Bengaluru (RCB) helped him recover from his hernia surgeries. Listen to StoryLive TVShareAdvertisementSuyash Sharma is playing for RCB in IPL 2025. Courtesy: PTIIndia Today Sports DeskNew Delhi,UPDATED: May 1, 2025 14:25 ISTIn ShortSuyash Sharma is playing for RCB in IPL 2025Suyash has 4 wickets from 9 matches in the tournamentSuyash said how he recovered from hernia surgeriesLeg-spinner Suyash Sharma thanked the Royal Challengers Bengaluru (RCB) for helping him in his hernia surgery. The leg-spinner said that he didn’t expect to feature in the first few games of the Indian Premier League (IPL) 2025 due to his injury. After making his IPL debut in 2023, the 21-year-old Suyash stayed with the Kolkata Knight Riders (KKR) for two seasons before RCB picked him for Rs 2.60 crore in the mega auction that took place in Jeddah last year. advertisementSuyash, who has 14 wickets to his name from 22 IPL matches, said that he once used to play with injections."
    },
    {
      "author": "Akainu",
      "page_url": "https://www.indiatoday.in/sports/cricket/story/suyash-sharma-rcb-ipl-2025-hernia-injection-2717992-2025-05-01",
      "published_day": 1,
      "published_month": 5,
      "published_year": 2025,
      "tags": [
        "suyashsharma",
        "rcb",
        "crickethealth"
      ],
      "text": "And there I had James Pipey. He and his family treated me like their own family. I had three hernias, I’m telling the truth — I didn’t even expect to play the first match. I was told that I should play after three or four matches because my surgery was quite major. “But James took such good care of me, better than anyone else could. I’m really thankful that I came to this franchise — I became completely fit. Otherwise, I have been dealing with this issue for the past two years. I had gotten used to playing in pain,” Suyash added. In nine matches in IPL 2025, Suyash has picked up four wickets at an economy rate of 7.97 with best figures of 4-0-26-2 against Punjab Kings (PBKS) on April 20 at the Maharaja Yadavindra Singh International Cricket Stadium in Mullanpur. RCB are currently placed atop of the table and will next face Chennai Super Kings (CSK) at home. Stay updated on IPL 2025 with India Today! Get match schedules, team squads, live score, and the latest IPL points table for CSK, MI, RCB, KKR, SRH, LSG, DC, GT, PBKS, and RR. Plus, keep track of the top contenders for the IPL Orange Cap and Purple Cap. Don't miss a moment!Published By: sabyasachi chowdhuryPublished On: May 1, 2025Also Read |  Rohit Sharma reveals chat with his parents after Wankhede stadium honour\nIN THIS STORY#IPL 2025Watch Live TV AdvertisementAlso WatchVideo: Moment Iranian missile hit a building in Israel's HaifaPresident Murmu moved to tears as visually impaired students wish her on birthdayPakistan admits India's BrahMos missiles struck Rawalpindi airbase during Op SindoorCongress clarifies Shashi Tharoor's absence from Kerala rally amid differencesPM Modi slams RJD, Congress for dynastic politics at Bihar rallyAdvertisementRead ThisHimanta Sarma flags beef consumption near temples on Eid, warns of strict actionAIFF Chief Kalyan Chaubey hits back at Bhutia, urges unity in football rowWatch: Yashasvi Jaiswal reminds Shubman Gill of his shaky running habit in viral videoWatch: Jaiswal roars in celebration after record-shattering century in LeedsCourt clears NCP leader’s chartered accountant in graft case due to lack of proofAdvertisement      \n\n\n\n  Follow Us On:                      AdvertisementPUBLICATIONSIndia TodayBusiness TodayIndia Today-HindiTIME TELEVISIONIndia Today TVAaj Tak Good News TodayEVENTSAgenda AajTakIndia Today ConclaveSahitya AajTak RADIOIshq FMAajTak RadioGAMINGIndia Today Gaming World Esports CupUSEFUL LINKSPress ReleaseSitemapNewsNewsletter Privacy PolicyCorrection PolicyLMIL DocumentsPRINTINGThomson PressWELFARECare TodayDISTRIBUTIONRate Card    SYNDICATIONS  Headlines Today        WEBSITES  India Today India Today Malayalam India Today NE Business Today DailyO AajTak Lallantop Bangla GNTTV iChowk Reader’s Digest Cosmopolitan    EDUCATION  Vasant Valley Best Colleges Best Universities          Download App              ABOUT US CONTACT US TERMS AND CONDITIONS ARCHIVES    Copyright © 2025 Living Media India Limited. For reprint rights: Syndications Today "
    }
  ],
  "timestamp": "2025-07-11T19:51:44.434181"
}